#导体假设直径
d_L =[
     [1.5, 1.4],
      [2.5,1.8],
      [4,2.3],
      [6,2.8],
      [10,3.6],
      [16,4.5],
      [25,5.6],
      [35,6.7],
      [50,8.0],
      [70,9.4],
      [95,11.0],
      [120,12.4],
      [150,13.8],
      [185,15.3],
      [240,17.5],
      [300,19.5],
      [400,22.6],
      [500,25.6],
      [630,28.3],
      [800,31.9],
      [1000,35.7]]
def r_d(input_list,match_index, return_index):
    """
    input_list: 需要匹配的值列表
    match_index: 匹配目标列表的第几个元素
    return_index: 返回目标列表的第几个元素
    """
    result = []  # 初始化结果列表
    # 遍历输入列表中的每个值
    for val in input_list:
        # 遍历目标二维列表中的每个子列表
        for item in d_L:
            # 如果当前输入值与目标子列表中指定索引位置的值相等
            if val == item[match_index]:
                # 将目标子列表中指定索引位置的值添加到结果列表中
                result.append(item[return_index])
    return result  # 返回匹配结果列表

